{
	"arr" : [
		{

			"title":"清华大学-数据结构",
			"content":"<br/> <br/> <br/><br/>一、课程的定位和在学校的发展历史<br/>　　“数据结构”课程是一门计算机专业的核心课程，它在整个计算机专业教学体系中处于举足轻重的地位。我校数据结构课程最初开设于 <br/>1978年，长期以来，数据结构教学得到计算机系领导高度重视，配备了优秀师资。先后参加数据结构教学组的教师包括严蔚敏、沈佩娟、唐泽 <br/>圣、米宁、殷人昆、邓俊辉等。1987年在对国外教材研究的基础上，严蔚敏老师等编写并出版了《数据结构》新教材，成为国内数据结构教材 <br/>的翘楚，1990年获得国家级特等奖。该教材至今已发行100万册以上。与教学配套，教学组在严蔚敏老师的主持下，在学校教务处的支持下，开 <br/>发了相应的演示系统和练习系统，有力地支援了数据结构的教学。<br/>　　1992年，课程教学形成老、中、青三结合，教授、副教授、讲师、博士生助教俱全的教学梯队；采用课堂面授、电脑演示、网络学习相结 <br/>合的多种媒体教学手段，达到新的层次，被学校评为校级一类课。<br/>",
			"keywords":["data_structure"]
		},
		{

			"title":"数据结构",
			"content":"实现顺序存储结构的方法是使用数组。数组把线性表的数据元素存储在一块连续地址空间的内存单元中，这样线性表中逻辑上相邻的数据元素在物理存储地址上也相邻。数据元素间的逻辑上的前驱、后继逻辑关系就表现在数据元素的存储单元的物理前后位置上。",
			"keywords":["data_structure"]
		},
		{

			"title":"数据结构所有资源",
			"content":"数据结构所有资源",
			"keywords":["data_structure"]
		},
		{

			"title":"全套的数据结构ppt",
			"content":"学习编写程序一定要写好数据结构，这是一套详细的数据结构ppt，数据结构(Data Structure)包括两方面的内容：数据和结构。 数据结构作为一门独立的课程是从1968年才开设的。而数据结构课程中的有关内容，如表处理、串处理、树结构等早已散见于计算机的其他课程，如操作系统、编译原理、表处理语言等课程中，但其内容都缺乏规范性和系统性。随着计算机科学的发展和计算机应用的普及，计算机加工、处理的对象已从早期的数值、布尔值扩展到字符串、表格、图像甚至语音等等。这些能被计算机存储、加工的对象称为数据。因此现在认为，数据包含数值和非数值两种类型。",
			"keywords":["data_structure"]
		},
		{

			"title":"数据结构(C语言版)(严蔚敏_吴伟民.扫描版 pdf",
			"content":"《清华大学计算机系列教材•数据结构(C语言版)》是为“数据结构”课程编写的教材，也可作为学习数据结构及其算法的c程序设计的参考教材。《清华大学计算机系列教材•数据结构(C语言版)》的前半部分从抽象数据类型的角度讨论各种基本类型的数据结构及其应用；后半部分主要讨论查找和排序的各种实现方法及其综合分析比较。其内容和章节编排与1992年4月出版的《数据结构》(第二版)基本一致，但在《清华大学计算机系列教材•数据结构(C语言版)》中更突出了抽象数据类型的概念。全书采用类C语言作为数据结构和算法的描述语言。",
			"keywords":["data_structure"]
		},
		{

			"title":"大话数据结构清晰版.pdf",
			"content":"本书为超级畅销书《大话设计模式》作者程杰潜心三年推出的扛鼎之作！以一个计算机教师教学为场景，讲解数据结构和相关算法的知识。通篇以一种趣味方式来叙述，大量引用了各种各样的生活知识来类比，并充分运用图形语言来体现抽象内容，对数据结构所涉及到的一些经典算法做到逐行分析、多算法比较。与市场上的同类数据结构图书相比，本书内容趣味易读，算法讲解细致深刻，是一本非常适合自学的读物。本书以一个计算机教师教学为场景，讲解数据结构和相关算法的知识。通篇?一种趣味方式来叙述，大量引用了各种各样的生活知识来类比，并充分运用图形语言来体现抽象内容，对数据结构所涉及到的一些经典算法做到逐行分析、多算法比较。与市场上的同类数据结构图书相比，本书内容趣味易读，算法讲解细致深刻，是一本非常适合自学的读物。",
			"keywords":["data_structure"]
		},
		{

			"title":"数据结构与算法-Python语言描述",
			"content":"21世纪以来，Python已经发展成为世界上受欢迎的编程语言之一，使用非常广泛。由于其各方面的优点，Python正在被世界上越来越多的大学用作**门程序设计课程的语言，更多学校把它作为后续或者选修课程的内容。国内也开始出现这种情况。作者从几年前开始基于Python语言讲授数据结构课程，本书基于作者的教学经验和体会编写而成。 本书结合抽象数据类型的思想，基于Python面向对象机制，阐述了各种基本数据结构的想法、性质、问题和实现，讨论一些相关算法的设计、实现和特性。书中还结合研究了一些数据结构的应用案例。 本书加强了一些目前程序设计实践领域特别关注的内容，包括程序和数据结构设计中的安全性问题、正则表达式的概念和使用等。书中提供了大量编程练习题，特别关注数据结构的设计和实现技术，以及实际应用中各方面的问题",
			"keywords":["data_structure"]
		},
		{

			"title":"数据结构与算法 清晰版",
			"content":"本书是关于计算机科学与工程领域的基础性研究科目之一——数据结构与算法的专著。 本书在简要回顾了基本的C++ 程序设计概念的基础上，全面系统地介绍了队列、堆栈、树、图等基本数据结构，以及贪婪算法、分而治之算法、分枝定界算法等多种算法设计方法，为数据结构与算法的继续学习和研究奠定了一个坚实的基础。更为可贵的是，本书不仅仅介绍了理论知识，还提供了50多个应用实例及600多道练习题。 本书内容广博权威，结构清晰合理，是一本全新的有关数据结构与算法的教材，对于计算机科学与工程领域的从业人员也是一本很好的参考书。",
			"keywords":["data_structure"]
		}
	]
}
